[
    {
      "_id": "624b2e8ef0a2adc217a28e8e",
      "picture": "http://placehold.it/32x32",
      "name": "Celeste Matthews",
      "rating": 4.9,
      "desc": " The best! Found me the perfect dress and such lovely service and attention. Not stuffy or overbearing and listen to what you want."
    },
    {
      "_id": "624b2e8e1d3d5b4ecd63cccb",
      "picture": "http://placehold.it/32x32",
      "name": "Kayla Henson",
      "rating": 4.3,
      "desc": "Such a lovely experience. The girls made the experience really enjoyable even in the current climate. They were so helpful from start to finish., offering great advise and going above a beyond to help me find the perfect dress."
    },
    {
      "_id": "624b2e8eb760b2903cde5b35",
      "picture": "http://placehold.it/32x32",
      "name": "Sharlene Zimmerman",
      "rating": 5.00,
      "desc": "OMG..great store !!! Found this store while visiting the UK.. what a find -nice clothing/well made/great prices. I never find anything I Iike in US plus size stores but I could have filled another suitcase in Yours* Will be shopping on this site from now on... please come to the US !!!"
    },
    {
      "_id": "624b2e8ee09d92c0ff80ae48",
      "picture": "http://placehold.it/32x32",
      "name": "Torres Hodge",
      "rating": 4.9,
      "desc": "I love the clothes from this website!! I am so glad I found them.....everything has been spot on, fits wonderfully, styles are trendy and lots to choose from!! Thanks for being here for us!!!"
    },
    {
      "_id": "624b2e8ec86d30de4f31ee7c",
      "picture": "http://placehold.it/32x32",
      "name": "Mcintyre Rivers",
      "rating": 4.7,
      "desc": "This is my very first order through site, and I am totally and completely satisfied! The fit is great and so are the prices. I will definitely return again and again..."
    },
    {
      "_id": "624b2e8ec616ceb24d4bb84f",
      "picture": "http://placehold.it/32x32",
      "name": "Trujillo Trujillo",
      "rating": 4.5,
      "desc": "I completely love this site, found it on EBay at first now I just order directly through them...I am always complemented on my outfits I will be back for more...Thank you for having cute trendy clothes that fit and look good."
    }
  ]